zephyrproject-rtos/zephyr/drivers/clock_control/clock_control_nxp_mcxw7x.c
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/drivers/clock_control.h>
#include <zephyr/types.h>
#include <zephyr/device.h>
#include <zephyr/logging/log.h>
#include <zephyr/pm/device.h>
#include <zephyr/dt-bindings/clock/nxp_mcxw7x_clock.h>

#include <fsl_clock.h>
#include <fsl_ccm32k.h>
#include <fsl_spc.h>

#define DT_DRV_COMPAT nxp_mcxw7x_clock

#define LOG_LEVEL CONFIG_CLOCK_CONTROL_LOG_LEVEL
LOG_MODULE_REGISTER(clock_control);

#define MCXW7_SPC_ADDR (SPC_Type *)DT_REG_ADDR(DT_INST(0, nxp_spc))

extern uint32_t SystemCoreClock;

/*
 * Mapping table from device tree clock IP mux values to HAL clock IP source values.
 * Used to translate DT-defined mux selections to the corresponding FSL SDK clock source.
 */
static clock_ip_src_t ip_clk_mux_mapping[] = {
	[MCXW_CLK_IP_MUX_FRO_6M] = kCLOCK_IpSrcFro6M,
	[MCXW_CLK_IP_MUX_FRO_192M_DIV] = kCLOCK_IpSrcFro192M,
	[MCXW_CLK_IP_MUX_SOSC] = kCLOCK_IpSrcSoscClk,
	[MCXW_CLK_IP_MUX_32K] = kCLOCK_IpSrc32kClk,
#if defined(CONFIG_SOC_MCXW70AC)
	[MCXW_CLK_IP_MUX_FRO_200M_DIV] = kCLOCK_IpSrcFro200M,
	[MCXW_CLK_IP_MUX_1M] = kCLOCK_IpSrc1M,
#endif /* CONFIG_SOC_MCXW70AC */
};

struct mcxw_clock_control_subsys_info {
	uint32_t flags: 4;
	uint32_t div: 4;
	uint32_t mux: 8;
	uint32_t offset: 16;
};

struct mcxw_clock_control_config {
	/* OSC32K mode configuration */
	uint8_t osc32k_mode;
	/* OSC32K XTAL capacitance configuration */
	ccm32k_osc_xtal_cap_t xtal_cap;
	/* OSC32K EXTAL capacitance configuration */
	ccm32k_osc_extal_cap_t extal_cap;
	/* OSC32K amplifier coarse gain adjustment */
	ccm32k_osc_coarse_adjustment_value_t coarse_adjustment;

	/* FIRC mode configuration */
	uint8_t firc_mode;
	/* FIRC frequency range configuration */
	uint8_t firc_range;

#if DT_INST_PROP(0, sirc_supported)
	/* Enable SIRC in low power mode */
	bool enable_sirc_in_lp_mode;
#endif

	/* System clock source selection */
	uint8_t sys_clk_src;
#if DT_INST_NODE_HAS_PROP(0, sys_clk_div_plat)
	/* System clock divider for platform clock (MCXW70 only) */
	uint8_t sys_clk_div_plat;
#endif
	/* System clock divider for slow clock */
	uint8_t sys_clk_div_slow;
	/* System clock divider for bus clock */
	uint8_t sys_clk_div_bus;
	/* System clock divider for core clock */
	uint8_t sys_clk_div_core;

	/* System oscillator frequency in Hz */
	uint32_t sosc_freq;
	/* Enable system oscillator */
	bool enable_sosc;
	/* Expected core clock frequency in Hz */
	uint32_t core_clock_frequency;
};

static int nxp_mcxw_clock_control_on(const struct device *dev, clock_control_subsys_t sub_system)
{
	struct mcxw_clock_control_subsys_info *subsys_info =
		(struct mcxw_clock_control_subsys_info *)&sub_system;

	if (subsys_info->offset == 0) {
		/* offset is 0 indicate do not support clock gate. */
		return 0;
	}

	clock_ip_name_t ip_name =
		(clock_ip_name_t)MAKE_MRCC_REGADDR(MRCC_BASE, subsys_info->offset);

	if ((subsys_info->flags & MCXW_CLK_LP_NO_STALL) != 0) {
		CLOCK_EnableClockLPMode(ip_name, (clock_ip_control_t)MRCC_CC(subsys_info->flags));
	} else {
		CLOCK_EnableClock(ip_name);
	}

	return 0;
}

static int nxp_mcxw_clock_control_off(const struct device *dev, clock_control_subsys_t sub_system)
{
	struct mcxw_clock_control_subsys_info *subsys_info =
		(struct mcxw_clock_control_subsys_info *)&sub_system;

	if (subsys_info->offset == 0) {
		/* offset is 0 indicate do not support clock gate. */
		return -ENOTSUP;
	}

	clock_ip_name_t ip_name =
		(clock_ip_name_t)MAKE_MRCC_REGADDR(MRCC_BASE, subsys_info->offset);
	CLOCK_DisableClock(ip_name);

	return 0;
}

static int nxp_mcxw_clock_control_get_rate(const struct device *dev,
					   clock_control_subsys_t sub_system, uint32_t *rate)
{
	struct mcxw_clock_control_subsys_info *subsys_info =
		(struct mcxw_clock_control_subsys_info *)&sub_system;
	if (subsys_info == NULL || rate == NULL) {
		return -EINVAL;
	}

	if (subsys_info->offset == 0) {
		/* offset is 0 indicate do not support clock gate. */
		return -ENOTSUP;
	}

	clock_ip_name_t ip_name =
		(clock_ip_name_t)MAKE_MRCC_REGADDR(MRCC_BASE, subsys_info->offset);

	if ((ip_name == kCLOCK_Wdog0) || (ip_name == kCLOCK_Wdog1)) {
		switch (subsys_info->mux) {
		case MCXW_CLK_IP_MUX_SLOW_CLK: {
			*rate = CLOCK_GetFreq(kCLOCK_SlowClk);
			break;
		}
		case MCXW_CLK_IP_MUX_SOSC: {
			*rate = CLOCK_GetFreq(kCLOCK_ScgSysOscClk);
			break;
		}
		case MCXW_CLK_IP_MUX_32K: {
			*rate = CLOCK_GetFreq(kCLOCK_RtcOscClk);
			break;
		}
		case MCXW_CLK_IP_MUX_FRO_6M: {
#if DT_INST_PROP(0, sirc_supported)
			*rate = CLOCK_GetFreq(kCLOCK_ScgSircClk);
#else
			/* SIRC not present on this SoC; FRO6M runs at a fixed 6 MHz */
			*rate = 6000000U;
#endif
			break;
		}
		default: {
			LOG_ERR("Unsupported clock source for watchdog");
			return -ENOTSUP;
		}
		}
	} else {
		*rate = CLOCK_GetIpFreq(ip_name);
	}

	return 0;
}

static int nxp_mcxw_clock_control_configure(const struct device *dev,
					    clock_control_subsys_t sub_system, void *data)
{
	struct mcxw_clock_control_subsys_info *subsys_info =
		(struct mcxw_clock_control_subsys_info *)&sub_system;

	if (subsys_info->offset == 0) {
		/* offset is 0 indicate do not support clock configure. */
		LOG_INF("Clock configure not supported for this subsystem, using default settings");
		return 0;
	}

	clock_ip_name_t ip_name =
		(clock_ip_name_t)MAKE_MRCC_REGADDR(MRCC_BASE, subsys_info->offset);

	/*
	 * Watchdog clock source is configured via its own WDOG_CS register,
	 * not through MRCC. Skip MRCC mux/div configuration for watchdog.
	 */
	if ((ip_name == kCLOCK_Wdog0) || (ip_name == kCLOCK_Wdog1)) {
		return 0;
	}

	if (subsys_info->mux != MCXW_CLK_IP_MUX_NONE) {
		CLOCK_SetIpSrc(ip_name, ip_clk_mux_mapping[subsys_info->mux]);
		CLOCK_SetIpSrcDiv(ip_name, subsys_info->div);
	}

	return 0;
}

static enum clock_control_status
nxp_mcxw_clock_control_get_status(const struct device *dev, clock_control_subsys_t sub_system)
{
	struct mcxw_clock_control_subsys_info *subsys_info =
		(struct mcxw_clock_control_subsys_info *)&sub_system;

	if (subsys_info == NULL) {
		return CLOCK_CONTROL_STATUS_UNKNOWN;
	}

	if (subsys_info->offset == 0) {
		/* offset is 0 indicate do not support clock gate. */
		return CLOCK_CONTROL_STATUS_UNKNOWN;
	}
	clock_ip_name_t ip_name =
		(clock_ip_name_t)MAKE_MRCC_REGADDR(MRCC_BASE, subsys_info->offset);

	uint32_t reg = CLOCK_REG(ip_name);

	if ((reg & MRCC_CC_MASK) == 0) {
		return CLOCK_CONTROL_STATUS_OFF;
	} else {
		return CLOCK_CONTROL_STATUS_ON;
	}
}

static int nxp_mcxw_clock_control_pm(const struct device *dev, enum pm_device_action action)
{
	ARG_UNUSED(dev);
	ARG_UNUSED(action);
	return 0;
}

#if !defined(CONFIG_TRUSTED_EXECUTION_NONSECURE)
static int nxp_mcxw_clock_validate_sys_clk_src(const struct mcxw_clock_control_config *config)
{
#if !DT_INST_PROP(0, sirc_supported)
	if (config->sys_clk_src == MCXW_CLK_SYSTEM_CLK_SRC_SIRC) {
		LOG_ERR("SIRC is not available as system clock source on this SoC");
		return -EINVAL;
	}
#endif

	switch (config->sys_clk_src) {
	case MCXW_CLK_SYSTEM_CLK_SRC_SOSC:
		if (!config->enable_sosc) {
			LOG_ERR("System OSC selected but not enabled in config");
			return -EINVAL;
		}
		break;
	case MCXW_CLK_SYSTEM_CLK_SRC_FIRC:
		if (config->firc_mode == MCXW_CLK_FIRC_DISABLE) {
			LOG_ERR("FIRC selected but disabled in config");
			return -EINVAL;
		}
		break;
	case MCXW_CLK_SYSTEM_CLK_SRC_SIRC:
	case MCXW_CLK_SYSTEM_CLK_SRC_ROSC:
		break;
	default:
		LOG_ERR("Unsupported system clock source %u", config->sys_clk_src);
		return -EINVAL;
	}

	return 0;
}
#endif /* !CONFIG_TRUSTED_EXECUTION_NONSECURE */

static int nxp_mcxw_clock_control_init(const struct device *dev)
{
	const struct mcxw_clock_control_config *config = dev->config;

#if defined(CONFIG_TRUSTED_EXECUTION_NONSECURE)
	/*
	 * TF-M non-secure build:
	 *
	 * Secure firmware owns global clock, oscillator, voltage,
	 * flash wait-state, power and security setup.
	 *
	 * Do not reconfigure SYSCLK, FIRC, SIRC, SOSC, ROSC, CCM32K,
	 * SPC or FMU from the non-secure image.
	 *
	 * The secure image must configure the clock tree before jumping
	 * to the non-secure image.
	 */

	if (config->core_clock_frequency != 0U) {
		SystemCoreClock = config->core_clock_frequency;
	} else {
		SystemCoreClock = CLOCK_GetCoreSysClkFreq();
	}

#else
	if (nxp_mcxw_clock_validate_sys_clk_src(config) != 0) {
		return -EINVAL;
	}

	/* Unlock Reference Clock Status Registers to allow writes */
	CLOCK_UnlockFircControlStatusReg();
#if DT_INST_PROP(0, sirc_supported)
	CLOCK_UnlockSircControlStatusReg();
#endif
	CLOCK_UnlockRoscControlStatusReg();
	CLOCK_UnlockSysOscControlStatusReg();

	CLOCK_SetXtal32Freq(32768U);

	/* Init OSC32K */
	CLOCK_SetRoscMonitorMode(kSCG_RoscMonitorDisable);

	/*
	 * CCM32K registers are not reset on a warm boot. If a previous application
	 * selected OSC32K as the 32 kHz clock source and this application disables
	 * OSC32K, CCM32K_Set32kOscConfig() asserts because OSC32K cannot be
	 * disabled while it is the active source. Switch the 32 kHz source back to
	 * FRO32K first.
	 */
	if ((config->osc32k_mode == kCCM32K_Disable32kHzCrystalOsc) &&
	    (CCM32K_GetClockSource(CCM32K) == kCCM32K_ClockSource32kOsc)) {
		/* FRO32K must be enabled before it can be selected as the source. */
		CCM32K_Enable32kFro(CCM32K, true);
		CCM32K_SelectClockSource(CCM32K, kCCM32K_ClockSourceSelectFro32k);
		/* Wait until FRO32K is the active 32 kHz clock source. */
		while ((CCM32K_GetStatusFlag(CCM32K) & kCCM32K_32kFroActiveStatusFlag) == 0UL) {
		}
	}

	ccm32k_osc_config_t ccm32k_osc_config = {
		.coarseAdjustment = config->coarse_adjustment,
		.enableInternalCapBank = true,
		.xtalCap = config->xtal_cap,
		.extalCap = config->extal_cap,
	};
	CCM32K_Set32kOscConfig(CCM32K, (ccm32k_osc_mode_t)config->osc32k_mode, &ccm32k_osc_config);

	/* Switch to safe clock source (SIRC) before reconfiguring FIRC */
	scg_sys_clk_config_t sys_clk_safe_config_source = {
#if DT_INST_NODE_HAS_PROP(0, sys_clk_div_plat)
		.divCore1 = (uint32_t)kSCG_SysClkDivBy1,
#endif
		.divSlow = (uint32_t)kSCG_SysClkDivBy4,
		.divBus = (uint32_t)kSCG_SysClkDivBy1,
		.divCore = (uint32_t)kSCG_SysClkDivBy1,
		.src = (uint32_t)kSCG_SysClkSrcSirc,
	};

	CLOCK_SetRunModeSysClkConfig(&sys_clk_safe_config_source);

	scg_sys_clk_config_t cur_config;
	/* Wait for clock source switch to finish */
	do {
		CLOCK_GetCurSysClkConfig(&cur_config);
	} while (cur_config.src != sys_clk_safe_config_source.src);

	/* Configuration to set FIRC */
	scg_firc_config_t scg_firc_config = {
		.enableMode = (config->firc_mode == MCXW_CLK_FIRC_DISABLE)
				      ? 0
				      : ((config->firc_mode == MCXW_CLK_FIRC_ENABLE)
						 ? kSCG_FircEnable
						 : kSCG_FircEnableInSleep),
		.range = (scg_firc_range_t)config->firc_range,
		.trimConfig = NULL,
	};

	/* Initialize FIRC */
	(void)CLOCK_InitFirc(&scg_firc_config);

#if DT_INST_PROP(0, sirc_supported)
	if (config->enable_sirc_in_lp_mode) {
		scg_sirc_config_t scg_sirc_config = {
			.enableMode = kSCG_SircEnableInSleep,
		};
		(void)CLOCK_InitSirc(&scg_sirc_config);
	}
#endif

	if (config->enable_sosc) {
		scg_sosc_config_t scg_sosc_config = {
			.freq = config->sosc_freq,
			.enableMode = kSCG_SoscEnable,
			.monitorMode = kSCG_SysOscMonitorDisable,
		};
		(void)CLOCK_InitSysOsc(&scg_sosc_config);
		CLOCK_SetXtal0Freq(config->sosc_freq);
	}

	if (config->core_clock_frequency == 96000000U) {
		/* Raise the core voltage to allow the system to run at 96MHz */
		spc_active_mode_core_ldo_option_t ldoOption;
		/* Configure Flash to support different voltage level and frequency */
		FMU0->FCTRL =
			(FMU0->FCTRL & ~((uint32_t)FMU_FCTRL_RWSC_MASK)) | (FMU_FCTRL_RWSC(0x2U));
		/* Specifies the operating voltage for the SRAM's read/write timing margin */
		SPC_SetSRAMOperateVoltage(MCXW7_SPC_ADDR, kSPC_SRAM_OperatVoltage1P1V);
		/* Set the LDO_CORE VDD regulator level */
		ldoOption.CoreLDOVoltage = kSPC_CoreLDO_NormalVoltage;
		ldoOption.CoreLDODriveStrength = kSPC_CoreLDO_NormalDriveStrength;
		(void)SPC_SetActiveModeCoreLDORegulatorConfig(MCXW7_SPC_ADDR, &ldoOption);
	}

	/* Configure system clock with user-defined settings */
	scg_sys_clk_config_t sys_clk_config = {
#if DT_INST_NODE_HAS_PROP(0, sys_clk_div_plat)
		.divCore1 = (config->sys_clk_div_plat - 1),
#endif
		.divSlow = (config->sys_clk_div_slow - 1),
		.divBus = (config->sys_clk_div_bus - 1),
		.divCore = (config->sys_clk_div_core - 1),
		.src = config->sys_clk_src,
	};

	CLOCK_SetRunModeSysClkConfig(&sys_clk_config);

	/* Wait for clock source switch to finish */
	do {
		CLOCK_GetCurSysClkConfig(&cur_config);
	} while (cur_config.src != sys_clk_config.src);

	SystemCoreClock = CLOCK_GetCoreSysClkFreq();

	if (SystemCoreClock != config->core_clock_frequency) {
		LOG_ERR("Core clock frequency mismatch: expected %u Hz, got %u Hz",
			config->core_clock_frequency, SystemCoreClock);
		k_panic();
	}

	if (config->osc32k_mode != kCCM32K_Disable32kHzCrystalOsc) {
		while ((CCM32K_GetStatusFlag(CCM32K) & kCCM32K_32kOscReadyStatusFlag) == 0UL) {
		}
		CCM32K_SelectClockSource(CCM32K, kCCM32K_ClockSourceSelectOsc32k);
		while ((CCM32K_GetStatusFlag(CCM32K) & kCCM32K_32kOscActiveStatusFlag) == 0UL) {
		}
		/* Wait for RTC Oscillator to be Valid */
		while (!CLOCK_IsRoscValid()) {
		}
		CLOCK_SetRoscMonitorMode(kSCG_RoscMonitorInt);
		/* Disable the FRO32K to save power */
		CCM32K_Enable32kFro(CCM32K, false);
#if FSL_FEATURE_CCM32K_HAS_CGC32K
		CCM32K_SelectClockSource(CCM32K, kCCM32K_ClockSourceSelectOsc32k);
#endif
	}

#if FSL_FEATURE_CCM32K_HAS_CGC32K
	/* Enable 32kHz clock output to all peripherals.  */
	CCM32K_EnableCLKOutToPeripherals(CCM32K, 0xFF);
#endif
#endif /* CONFIG_TRUSTED_EXECUTION_NONSECURE */

	return pm_device_driver_init(dev, nxp_mcxw_clock_control_pm);
}

static DEVICE_API(clock_control, nxp_mcxw_clock_control_api) = {
	.on = nxp_mcxw_clock_control_on,
	.off = nxp_mcxw_clock_control_off,
	.get_rate = nxp_mcxw_clock_control_get_rate,
	.get_status = nxp_mcxw_clock_control_get_status,
	.configure = nxp_mcxw_clock_control_configure,
};

static struct mcxw_clock_control_config config = {
	.osc32k_mode = DT_INST_PROP(0, osc32k_mode),
	.xtal_cap = DT_INST_PROP(0, osc32k_xtal_cap),
	.extal_cap = DT_INST_PROP(0, osc32k_extal_cap),
	.coarse_adjustment = DT_INST_PROP(0, osc32k_coarse_adjustment),
	.firc_mode = DT_INST_PROP(0, firc_mode),
	.firc_range = DT_INST_PROP(0, firc_range),
#if DT_INST_PROP(0, sirc_supported)
	.enable_sirc_in_lp_mode = DT_INST_PROP(0, enable_sirc_in_lp_mode),
#endif
	.sys_clk_src = DT_INST_PROP(0, sys_clk_src),
#if DT_INST_NODE_HAS_PROP(0, sys_clk_div_plat)
	.sys_clk_div_plat = DT_INST_PROP(0, sys_clk_div_plat),
#endif
	.sys_clk_div_bus = DT_INST_PROP(0, sys_clk_div_bus),
	.sys_clk_div_slow = DT_INST_PROP(0, sys_clk_div_slow),
	.sys_clk_div_core = DT_INST_PROP(0, sys_clk_div_core),
	.enable_sosc = DT_INST_PROP(0, enable_sosc),
	.sosc_freq = DT_INST_PROP(0, sosc_freq),
	.core_clock_frequency = DT_INST_PROP(0, core_clock_frequency),
};

DEVICE_DT_INST_DEFINE(0, nxp_mcxw_clock_control_init, NULL, NULL, &config, PRE_KERNEL_1,
		      CONFIG_CLOCK_CONTROL_INIT_PRIORITY, &nxp_mcxw_clock_control_api);
